var channelList = [
{
    t: ' 红心兆赫',
    v: -1
},
{
    t: '私人兆赫',
    v: 0
},
{
    t: '公共兆赫',
    sub: [
        {
        t: '地区&语言',
        sub: [
            {
            t: '华语MHz',
            v: 1
        },
        {
            t: '欧美MHz',
            v: 2
        },
        {
            t: '粤语MHz',
            v: 6
        },
        {
            t: '法语MHz',
            v: 22
        },
        {
            t: '日语MHz',
            v: 17
        },
        {
            t: '韩语MHz',
            v: 18
        }
        ]
    },
    {
        t: '流派',
        sub: [
            {
            t: '民谣MHz',
            v: 8
        },
        {
            t: '摇滚MHz',
            v: 7
        },
        {
            t: '爵士MHz',
            v: 13
        },
        {
            t: '古典MHz',
            v: 27
        },
        {
            t: '轻音乐MHz',
            v: 9
        },
        {
            t: '电子MHz',
            v: 14
        },
        {
            t: 'R&BMHz',
            v: 16
        },
        {
            t: '说唱MHz',
            v: 15
        },
        {
            t: '电影原声MHz',
            v: 10
        }
        ]
    },
    {
        t: '年代',
        sub: [
            {
            t: '七零MHz',
            v: 3
        },
        {
            t: '八零MHz',
            v: 4
        },
        {
            t: '九零MHz',
            v: 5
        }
        ]
    },
    {
        t: '豆瓣音乐人',
        sub: [
            {
            t: '豆瓣音乐人MHz',
            v: 26
        }
        ]
    },
    {
        t: '特辑',
        sub: [
            {
            t: '女声MHz',
            v: 20
        },
        {
            t: '动漫MHz',
            v: 28
        },
        {
            t: '咖啡MHz',
            v: 32
        }
        ]
    },
    {
        t: '品牌',
        sub: [
            {
            t: '乐混翻唱MHz',
            v: 52
        },
        {
            t: '格调卡萨帝MHz',
            v: 54
        }
        ]
    }
    ]
}
];
